using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace PROG_POE
{
    internal class UIHelper
    {
        public static void ShowLogo()
        {
            Console.ForegroundColor = ConsoleColor.Yellow;

            Console.WriteLine("Hello I'm your Cybersecurity Awareness Bot. I will guide you on how to stay safe online and protect your information.");
            Console.WriteLine("=======================================");
            Console.WriteLine("   CYBERSECURITY AWARENESS BOT");
            Console.WriteLine("=======================================\n");

            Console.WriteLine("██╗  ██╗     ██████╗██╗   ██╗██████╗ ███████╗██████╗ ██████╗  ██████╗ ████████╗\r\n╚██╗██╔╝    ██╔════╝╚██╗ ██╔╝██╔══██╗██╔════╝██╔══██╗██╔══██╗██╔═══██╗╚══██╔══╝\r\n ╚███╔╝     ██║      ╚████╔╝ ██████╔╝█████╗  ██████╔╝██████╔╝██║   ██║   ██║   \r\n ██╔██╗     ██║       ╚██╔╝  ██╔══██╗██╔══╝  ██╔══██╗██╔══██╗██║   ██║   ██║   \r\n██╔╝ ██╗    ╚██████╗   ██║   ██████╔╝███████╗██║  ██║██████╔╝╚██████╔╝   ██║   \r\n╚═╝  ╚═╝     ╚═════╝   ╚═╝   ╚═════╝ ╚══════╝╚═╝  ╚═╝╚═════╝  ╚═════╝    ╚═╝   \r\n                                                                               ");
            Console.WriteLine("      Stay Safe Online!");
            Console.WriteLine("=======================================\n");

            Console.ResetColor();
        }
    }
}

